# TagTag Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TagTag Property
ParameterTypeId Class See Also
---
"Label"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TagTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagTag As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TagTag {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace